In [1]:
import pandas as pd

In [3]:
df1 = pd.read_csv('temp2.csv',header=None,names=['Date','City','Temperature','Humidity'])
df1

       Date       City  Temperature  Humidity
0  05-01-17  Kathmandu           24        56
1  05-01-17  Kathmandu           21        53
2  05-02-17  Kathmandu           22        53
3  05-02-17  Kathmandu           26        58
4  05-01-17    Pokhara           25        60
5  05-01-17    Pokhara           22        62
6  05-02-17    Pokhara           26        64
7  05-02-17    Pokhara           25        60

In [7]:
df1.pivot_table(index='Date',columns='City',aggfunc='sum',margins=True)

          Humidity                Temperature
City     Kathmandu Pokhara    All   Kathmandu Pokhara    All
Date
05-01-17     109.0   122.0  231.0        45.0    47.0   92.0
05-02-17     111.0   124.0  235.0        48.0    51.0   99.0
All          220.0   246.0  466.0        93.0    98.0  191.0

In [13]:
df2 = pd.read_csv('temp3.csv',header=None,names=['Date','City','Temperature','Humidity'])
df2

       Date       City  Temperature  Humidity
0  05-01-17  Kathmandu           24        56
1  05-02-17  Kathmandu           21        53
2  05-03-17  Kathmandu           22        58
3  06-01-17    Pokhara           26        64
4  06-02-17    Pokhara           25        60
5  06-03-17    Pokhara           22        62

In [19]:
# Date is currently string and needs to be converted to a date or timestamp

df2['Date']= pd.to_datetime(df2['Date'])

In [20]:
type(df2['Date'][0])

pandas._libs.tslib.Timestamp

In [22]:
df2.pivot_table(index=pd.Grouper(freq='M',key='Date'),columns='City')

             Humidity         Temperature
City        Kathmandu Pokhara   Kathmandu    Pokhara
Date
2017-05-31  55.666667     NaN   22.333333        NaN
2017-06-30        NaN    62.0         NaN  24.333333